# 算术运算符 赋值运算符 比较运算符 逻辑运算符
#
# #1.算术运算符
# print("10 + 4 = ",10 + 4)#加法
# print("10 - 4 = ",10 - 4)#减法
# print("10 * 4 = ",10 * 4)#乘法
# print("10 / 4 = ",10 / 4)#除法
# print("10 // 4 = ",10 // 4)#整除
# print("10 % 4 = ",10 % 4)#取余/求模
# print("10 ** 4 = ",10 ** 4)#幂指数次方

#算术运算符的优先级--->**--->* / // % ----->+ -
# 0.09999999999999998精度损失
#案例 求x+y 和x-y
# #float(..)将其他类型转换为浮点型
# x = float(input("请输入x的值"))
# y = float(input("请输入y的值"))
#
# print("x + y的值为:",x + y)
# print("x - y的值为:",x - y)

# 赋值运算符

#比较运算符
# ==等于 !=不等于


#逻辑运算符 and(并且) or(或者) not(取反)布尔表达式

#案例
num = int(input("请输入一个整数"))
print(f"{num}在10到20之间: ",not 10 <= num <= 20)