# # 元组是不可变的序列 创建后不可修改
# # 特点:可储存不同元素 可重复 有序 但不可修改(支持索引访问 切片)
# #定义元组
# """
# 元组名称 = (元素1,元素2,....)
# #定义空元组
# 元组名称 = ()
# 元组名称 = tuple()
# """
# # 方法: count() 统计次数  index()查找第一次的索引位置
# t1 = (80,95,78,50,76,88,20,16)
# print(t1)
# print(type(t1))
#
# print(t1[0])
# print(t1[-1])
#
# # 切片
# print(t1[0:5:1])
#
# #
# print(t1.count(80))
# print(t1.index(80))
#



#组包和解包
#
# # *表示收集剩余所有元素 并生成列表
#
# t1 = (5,7,66,94,8,64,13,5)
# t2 = 5,7,66,94,8,64,13,5
#
# print(t1)
# print(t2)

# 解包操作
# a,b,c,d,e,f,g,h = t1


#案例

students = (
    ("S001","王林",85,92,78),
    ("S002","李婉慕",92,88,95),
    ("S003", "十三", 78, 85, 92),
)
print("学号\t\t姓名\t\t语文\t\t数学\t\t英语\t\t总分\t\t平均分")
for s in students:
    total = s[2] + s[3] + s[4]
    avg = total / 3
    print(f"{s[0]} \t {s[1]} \t {s[2]} \t {s[3]} \t {s[4]} \t {total} \t {avg:.1f}")

#统计最高分最低分平均分 并输出
#2.1 获取成绩
chinese_scores = [s[2] for s in students]
print(f"语文最低分:{min(chinese_scores)}")


#2.2输出最大最小平均

